---
kind: method
id: M:Autodesk.Revit.DB.TransactionGroup.Dispose
source: html/eb2b4351-d808-9232-fab8-d21aee6d705b.htm
---
# Autodesk.Revit.DB.TransactionGroup.Dispose Method

Releases all resources used by the TransactionGroup

## Syntax (C#)
```csharp
public void Dispose()
```